{
  "irVersion": "1.0",
  "project": "omni-aws/omnistorage",
  "repository": "https://github.com/plexusone/omni-aws",
  "versioning": "semver",
  "commitConvention": "conventional",
  "releases": [
    {
      "version": "v0.1.0",
      "date": "2026-04-25",
      "highlights": [
        { "description": "Initial release with S3-compatible backend for omnistorage-core" }
      ],
      "added": [
        { "description": "S3 backend implementing `omnistorage.ExtendedBackend` interface", "commit": "7ff260a" },
        { "description": "Support for AWS S3, Cloudflare R2, MinIO, Wasabi, DigitalOcean Spaces", "commit": "7ff260a" },
        { "description": "Streaming read/write with multipart upload support", "commit": "7ff260a" },
        { "description": "Server-side copy and move operations", "commit": "7ff260a" },
        { "description": "Range read requests for partial content", "commit": "7ff260a" },
        { "description": "MD5 hash support via ETag", "commit": "7ff260a" },
        { "description": "Configurable concurrency and part size", "commit": "7ff260a" },
        { "description": "Environment-based and programmatic configuration", "commit": "7ff260a" },
        { "description": "Backend registry integration (auto-registers as `s3`)", "commit": "7ff260a" }
      ],
      "dependencies": [
        { "description": "AWS SDK v2 for S3 operations", "component": "github.com/aws/aws-sdk-go-v2", "componentVersion": "1.41.5" },
        { "description": "omnistorage-core v0.3.0 for backend interfaces", "component": "github.com/plexusone/omnistorage-core", "componentVersion": "0.3.0" }
      ],
      "tests": [
        { "description": "Unit tests for config validation, parsing, and interface compliance", "commit": "7ff260a" },
        { "description": "Integration tests for S3 operations (require OMNISTORAGE_S3_TEST_BUCKET)", "commit": "7ff260a" }
      ]
    }
  ]
}
