{
  "irVersion": "1.0",
  "project": "omni-aws/omnillm",
  "repository": "https://github.com/plexusone/omni-aws",
  "versioning": "semver",
  "commitConvention": "conventional",
  "releases": [
    {
      "version": "v0.6.0",
      "date": "2026-04-25",
      "highlights": [
        { "description": "Repository reorganized as multi-module AWS provider package" }
      ],
      "breaking": [
        { "description": "Module path changed from `github.com/plexusone/omnillm-bedrock` to `github.com/plexusone/omni-aws/omnillm`", "commit": "9bd30a4" }
      ],
      "upgradeGuide": [
        { "description": "Update import paths from `github.com/plexusone/omnillm-bedrock` to `github.com/plexusone/omni-aws/omnillm`" },
        { "description": "Run `go get github.com/plexusone/omni-aws/omnillm@v0.6.0` to update dependency" }
      ],
      "changed": [
        { "description": "Code moved to `omnillm/` subdirectory within omni-aws monorepo", "commit": "9bd30a4" }
      ]
    },
    {
      "version": "v0.5.0",
      "date": "2026-04-12",
      "highlights": [
        { "description": "Migration to omnillm-core (thin/thick provider architecture)" }
      ],
      "changed": [
        { "description": "Dependency changed from `omnillm` v0.14.0 to `omnillm-core` v0.15.0", "commit": "35b16ed" },
        { "description": "Import paths updated from `omnillm/provider` to `omnillm-core/provider`", "commit": "35b16ed" }
      ],
      "upgradeGuide": [
        { "description": "Update any direct imports from `github.com/plexusone/omnillm/provider` to `github.com/plexusone/omnillm-core/provider`" },
        { "description": "Run `go get github.com/plexusone/omnillm-bedrock@v0.5.0` to update dependency" }
      ],
      "dependencies": [
        { "description": "Replace `github.com/plexusone/omnillm` v0.14.0 with `github.com/plexusone/omnillm-core` v0.15.0", "commit": "35b16ed" }
      ],
      "documentation": [
        { "description": "Updated README.md with correct import paths", "commit": "35b16ed" }
      ]
    },
    {
      "version": "v0.4.0",
      "date": "2026-03-16",
      "highlights": [
        { "description": "Organization migration from agentplexus to plexusone" }
      ],
      "breaking": [
        { "description": "Module path changed from `github.com/agentplexus/omnillm-bedrock` to `github.com/plexusone/omnillm-bedrock`", "commit": "7fba48a" }
      ],
      "upgradeGuide": [
        { "description": "Update import paths from `github.com/agentplexus/omnillm-bedrock` to `github.com/plexusone/omnillm-bedrock`" },
        { "description": "Run `go get github.com/plexusone/omnillm-bedrock@v0.4.0` to update dependency" }
      ],
      "changed": [
        { "description": "Module path migrated to `github.com/plexusone/omnillm-bedrock`", "commit": "7fba48a" },
        { "description": "Dependency updated to `github.com/plexusone/omnillm` v0.13.0", "commit": "7fba48a" }
      ],
      "dependencies": [
        { "description": "Bump `github.com/plexusone/omnillm` from v0.10.0 to v0.13.0", "commit": "7fba48a" },
        { "description": "Bump `github.com/aws/aws-sdk-go-v2/config` to v1.32.12", "commit": "de0d589" },
        { "description": "Bump `github.com/aws/aws-sdk-go-v2/service/bedrockruntime` to v1.50.2", "commit": "4dde2bc" },
        { "description": "Bump `github.com/aws/smithy-go` from v1.24.0 to v1.24.2", "commit": "6d6ce16" }
      ]
    },
    {
      "version": "v0.3.0",
      "date": "2026-01-04",
      "highlights": [
        { "description": "Streaming support via Bedrock ConverseStream API" },
        { "description": "Full tool/function calling with streaming tool deltas" },
        { "description": "Simplified authentication with Bedrock API keys (`AWS_BEARER_TOKEN_BEDROCK`)" },
        { "description": "Comprehensive test suite: 18 unit tests + 8 integration tests" }
      ],
      "added": [
        { "description": "Streaming support via `CreateChatCompletionStream` using Bedrock's ConverseStream API", "commit": "c06e0a6" },
        { "description": "`stream.go` with event handling for text deltas, tool use deltas, and metadata", "commit": "c06e0a6" },
        { "description": "Tool/function calling support with `ToolConfiguration` mapping", "commit": "c06e0a6" },
        { "description": "Tool choice options: auto, required, none, specific tool", "commit": "c06e0a6" },
        { "description": "Streaming tool call support with incremental argument delivery", "commit": "c06e0a6" },
        { "description": "Bearer token authentication via `AWS_BEARER_TOKEN_BEDROCK` environment variable", "commit": "9327662" },
        { "description": "Integration tests (8 tests) covering completions, streaming, and tool calling", "commit": "229d6e8" },
        { "description": "Unit tests (18 tests) with mock Bedrock client", "commit": "229d6e8" },
        { "description": "CI/CD documentation for GitHub Actions with both auth methods", "commit": "7ccf0c2" }
      ],
      "changed": [
        { "description": "README.md updated with credential chain priority table", "commit": "7ccf0c2" },
        { "description": "README.md updated with testing documentation and environment variables", "commit": "7ccf0c2" },
        { "description": "Bedrock model access section simplified (AWS auto-enables models on first invocation)", "commit": "7ccf0c2" }
      ],
      "removed": [
        { "description": "`types.go` removed (types consolidated into other files)", "commit": "c06e0a6" }
      ],
      "dependencies": [
        { "description": "Added `github.com/aws/smithy-go` as direct dependency for bearer token support", "commit": "9327662", "component": "github.com/aws/smithy-go", "componentVersion": "1.24.0" }
      ],
      "documentation": [
        { "description": "Added AWS authentication priority table with 7 credential sources", "commit": "7ccf0c2" },
        { "description": "Added Bedrock API key setup instructions", "commit": "7ccf0c2" },
        { "description": "Added Testing section with unit and integration test commands", "commit": "7ccf0c2" },
        { "description": "Added CI/CD examples for GitHub Actions", "commit": "7ccf0c2" },
        { "description": "Created ROADMAP.md with implementation phases", "commit": "7ccf0c2" }
      ],
      "internal": [
        { "description": "Added `.gitignore` for credentials and IDE files", "commit": "fdb2d1f" },
        { "description": "Renamed `.env.sh` to `.envrc` for direnv compatibility", "commit": "fdb2d1f" }
      ]
    },
    {
      "version": "v0.2.0",
      "date": "2025-12-27",
      "added": [
        { "description": "Core chat completion support via Bedrock Converse API", "commit": "3df093e" },
        { "description": "System message handling (extracted to Bedrock system blocks)", "commit": "3df093e" },
        { "description": "Multi-turn conversation support", "commit": "3df093e" },
        { "description": "Inference configuration (MaxTokens, Temperature, TopP, Stop)", "commit": "3df093e" },
        { "description": "Token usage reporting", "commit": "3df093e" }
      ],
      "documentation": [
        { "description": "Initial README with usage examples", "commit": "3df093e" },
        { "description": "AWS authentication documentation", "commit": "3df093e" }
      ],
      "ci": [
        { "description": "Add GitHub Actions CI workflow", "commit": "9babd35" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2025-12-21",
      "added": [
        { "description": "Initial release", "commit": "9c557d0" },
        { "description": "Basic Bedrock client wrapper", "commit": "9c557d0" },
        { "description": "Provider interface implementation for omnillm", "commit": "9c557d0" }
      ]
    }
  ]
}
